Revit 2027 API
CitySet.Contains Method
Tests for the existence of a city within the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	City item
)
Public Overridable Function Contains (
	item As City
) As Boolean
public:
virtual bool Contains(
	City^ item
)
abstract Contains :
        item : City -> bool
override Contains :
        item : City -> bool
Parameters
item City
The city to be searched for.
Return Value
Boolean
The Contains method returns True if the city is within the set, otherwise False.
See Also
Reference
CitySet Class
Autodesk.Revit.DB Namespace